# 모스 부호 딕셔너리
hash_Dict = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.',
             'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..',
             'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
             'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
             'Y': '-.--', 'Z': '--..', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', '0': '-----',
             ',': '--..--', '.': '.-.-.-', '?': '..--..', ':': '---...', '-': '-....-', '@': '.--.-.'}

# 모스 부호에서 알파벳으로 변환하기 위해 딕셔너리 역변환
reverse_hash_Dict = {value: key for key, value in hash_Dict.items()}

n = int(input())
word = input()
words = word.split(' ')
answer = ''

# 모스 부호를 알파벳으로 변환
for i in words:
    answer += reverse_hash_Dict[i]

print(answer)